IndependentStudentWork/app/controllers/labs_controller.rb

  def index
    @LaboratiryWorks=Lab.all
---
SELECT "labs".* FROM "labs"

  def show
    @LaboratiryWork=Lab.find(params[:id])
---
SELECT "labs".* FROM "labs" WHERE "labs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    lab=Lab.new(params.require(:lab).permit(:title,:description))
    lab.user_id=1
    if lab.save
---
INSERT INTO "labs" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "JSK"], ["description", "s"], ["created_at", "2022-01-12 18:16:23.983591"], ["updated_at", "2022-01-12 18:16:23.983591"], ["user_id", 1]]

  def edit
    @LaboratiryWork=Lab.find(params[:id])
---
SELECT "labs".* FROM "labs" WHERE "labs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @LaboratiryWork=Lab.find(params[:id])
    @LaboratiryWork.update(params.require(:lab).permit(:title,:description))
---
SELECT "labs".* FROM "labs" WHERE "labs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "labs" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "labs"."id" = ?  [["title", "Лабораторная работа №1"], ["description", "Тестовое описание лабораторной работы."], ["updated_at", "2022-01-12 18:54:02.833068"], ["id", 1]]

  def destroy
    @LaboratiryWork=Lab.find(params[:id])
    @LaboratiryWork.destroy
---
SELECT "labs".* FROM "labs" WHERE "labs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "labs" WHERE "labs"."id" = ?  [["id", 2]]

  def mark
    @LaboratiryWork=Lab.find(params[:id])
---
SELECT "labs".* FROM "labs" WHERE "labs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def grade
    @LaboratiryWork=Lab.find(params[:id])
    if @LaboratiryWork.update(params.permit(:grade))
---
SELECT "labs".* FROM "labs" WHERE "labs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "labs" SET "grade" = ?, "updated_at" = ? WHERE "labs"."id" = ?  [["grade", "A"], ["updated_at", "2022-01-12 18:18:11.197204"], ["id", 1]]